{"sections":{"page":{"type":"page","disabled":true,"settings":{"color_scheme":"default","container_size":"large","section_spacing_top":96,"section_spacing_bottom":96,"show_heading":true}},"questions":{"type":"faq","blocks":{"category1":{"type":"category","settings":{"title":"GENERAL FAQS","background_color":"#f5f5f5","icon":"none"}},"question1":{"type":"question","settings":{"title":"What makes Yarn Corp’s First Nations uniforms different?","icon":"none","text":"<p>Our designs aren’t just visually striking - they carry Cultural significance and storytelling, fostering inclusion in the workplace. Every artwork is licensed, ensuring that First Nations artists receive royalties on every purchase. By choosing Yarn Corp, you’re supporting Indigenous artists while elevating your brand’s commitment to cultural inclusion.<\/p>","page":"","image_width":100}},"question2":{"type":"question","settings":{"title":"What industries do you work with?","icon":"none","text":"<p>We proudly supply corporate teams, schools, government departments, hospitals, hospitality, mining, and more. Whatever your industry, we can create First Nations-inspired workwear designed to suit your team’s needs.<\/p>","page":"","image_width":100}},"question3":{"type":"question","settings":{"title":"Do you support Reconciliation Action Plan (RAP) initiatives?","icon":"none","text":"<p>Yes! Many of our corporate clients choose our products to support their Reconciliation Action Plan (RAP) commitments. We can even incorporate your RAP artwork into custom designs, ensuring a meaningful and authentic representation of your brand’s commitment to reconciliation.<\/p>","page":"","image_width":100}},"question_jmmP3g":{"type":"question","settings":{"title":"Can I get a sample prior to placing my order?","icon":"none","text":"<p>We offer sample packs so you can check quality and sizing before committing to a full order. If you need to confirm sizing for your team, let us know - we can arrange sample sets for you to trial and return. <\/p>","page":"","image_width":100}},"question_YGtJXH":{"type":"question","settings":{"title":"Do you offer bulk discounts?","icon":"none","text":"<p>Yes! We offer bulk order discounts using tiered pricing based on order volume. The more you order, the more you save. For large orders or ongoing partnerships, reach out to our team to discuss pricing options.<\/p>","page":"","image_width":100}},"question_q6L94f":{"type":"question","settings":{"title":"Can I reorder the same design later?","icon":"none","text":"<p>Absolutely! Once you’ve placed an order, we securely store your designs, logos, and specifications, making reordering seamless. Simply get in touch when you’re ready for a restock, and we’ll take care of the rest!<\/p>","page":"","image_width":100}},"question_paLCbE":{"type":"question","settings":{"title":"Do you offer rush orders for urgent deadlines?","icon":"none","text":"<p>Yes! Our Express Range offers custom polos & merch in just 7-10 days. For super urgent orders, get in touch, and we’ll see what we can do to meet your deadline.<\/p>","page":"","image_width":100}},"category2":{"type":"category","settings":{"title":"Ordering & Manufacturing FAQs","background_color":"#f5f5f5","icon":"none"}},"question4":{"type":"question","settings":{"title":"How can I pay for my order?","icon":"none","text":"<p>We offer two payment options:<\/p><ul><li>Credit Card: Pay instantly at checkout.<\/li><li>Tax Invoice: Payment is required upfront before we can submit your order to production, as our suppliers do not accept unpaid orders.<\/li><\/ul><p>If paying by invoice, please forward your remittance to corporate@yarn.com.au or your sales representative to ensure we can track the funds and process your order as quickly as possible.<\/p>","page":"","image_width":50}},"question5":{"type":"question","settings":{"title":"Can I place my order with a purchase order (PO)?","icon":"none","text":"<p>Yes! If your company requires a purchase order, simply send us your official PO document along with your order details. Our team will process your order accordingly. Please note we do require payment upfront on all orders. <\/p>","page":"","image_width":100}},"question6":{"type":"question","settings":{"title":"How do I add my logo for free?","icon":"none","text":"<p>You can upload your logo directly on the product page when placing your order. Simply click the \"Upload Your Logo\" button and follow the prompts. Before uploading, make sure to check our artwork guidelines (found below the upload button) to ensure your logo meets the required specifications for streamlined order processing.<\/p>","page":"","image_width":100}},"question7":{"type":"question","settings":{"title":"What’s the difference between Full Custom & Express Custom Orders?","icon":"none","text":"<p>Full Custom Orders are designed from scratch, allowing complete flexibility with colours, branding, and artwork. These take 5–6 weeks to produce, with a fast-track option available for urgent orders. Express Custom Orders offer a quicker turnaround, using stock available on hand. These orders are printed in our Meanjin warehouse and delivered within 7–10 days, making them a great choice for tight deadlines.<\/p>","page":"","image_width":100}},"question_UBnHmz":{"type":"question","settings":{"title":"Do you offer design assistance?","icon":"none","text":"<p>Yes! Our in-house team can help adapt existing designs or create something entirely unique. We can also match your branding colours to any Pantone shade.<\/p>","page":"","image_width":100}},"question_M8wTb3":{"type":"question","settings":{"title":"Can you use my organisation’s artwork instead of Yarn’s designs?","icon":"none","text":"<p>Yes! If you have existing artwork, we can apply it to polos, tees, lanyards, and more. Need help digitising your artwork? Our team can assist with that too.<\/p>","page":"","image_width":100}},"question_eKrAfm":{"type":"question","settings":{"title":"What is the correct file format and size for uploading my logo and\/or artwork?","icon":"none","text":"<p>You can find our guidelines for artwork submissions below the upload your logo button. Please try to upload high resolution files in AI, SVG, PDF or EPS format as these are the best quality for our designers to work with. If you do not have the correct file format we can assist you with redrawing your logo. Reach out to a customer service representative to begin this process.<\/p>","page":"","image_width":100}},"question_Xybg4n":{"type":"question","settings":{"title":"Will I receive an order confirmation?","icon":"none","text":"<p>Yes! We’ll keep you updated every step of the way. Once you place your order, you’ll receive an automated confirmation email. Within 24 hours, we’ll send your artwork presentation mockup. If we need an alternate version of your logo or artwork, or if you’ve made any special requests, we’ll be in touch with further details. If you haven’t received anything, be sure to check your junk or spam folder. Still no email? Get in touch, and we’ll confirm everything for you.<\/p>","page":"","image_width":100}},"question_AiXCmX":{"type":"question","settings":{"title":"How long does it take to receive my order? ","icon":"none","text":"<p>Our ordering process varies depending on the type of product you choose:<\/p><ul><li>Full Custom Orders – Designed from scratch, these take approximately 5–6 weeks for production, with a fast-track option available.<\/li><li>Express Orders – A quicker solution using pre-set designs, typically delivered within 7-10 days.<\/li><li>Bespoke Orders – Tailored to your needs with some level of customisation, timeframes depend on design complexity and production requirements.<\/li><li>Off-the-Shelf Products – Ready-to-ship items available immediately, depending on stock levels.<\/li><\/ul><p>After placing your order, you can expect your artwork presentation mockup within 24 hours (if applicable). <\/p><p>For full details on each ordering option, visit our Ordering Process page<a href=\"https:\/\/corporate.yarn.com.au\/pages\/ordering-process\"> <span style=\"text-decoration:underline\">here<\/span><\/a>.<\/p>","page":"","image_width":100}},"question_XYWmtF":{"type":"question","settings":{"title":"How long does it take to receive my order? ","icon":"none","text":"<p>Absolutely! We can help you create something with your own art, source bespoke art from one of our collaborating artists, or enquire about using any of the designs from our sister site Yarn Marketplace. Reach out to our team to begin this process.<\/p>","page":"","image_width":100}},"category3":{"type":"category","settings":{"title":"Shipping & Returns FAQs","background_color":"#f5f5f5","icon":"none"}},"question8":{"type":"question","settings":{"title":"Can I track my order?","icon":"none","text":"<p>Yes! Once your order has been dispatched, you’ll receive and email containing tracking information. For updates, you can also contact your sales representative. clear answer<\/p>","page":"","image_width":100}},"question9":{"type":"question","settings":{"title":"What if I haven't received part of my order?","icon":"none","text":"<p>We manually quality check and count every order in our Brisbane dispatch warehouse before shipping. However, if any stock is missing, please contact your sales representative <strong>immediately <\/strong>with your order number and an accurate count of what you’ve received.<\/p><p>To ensure a quick resolution, avoid responding to automated emails - reach out directly, and we’ll sort it out as soon as possible.<\/p>","page":"","image_width":100}},"question_eBBcid":{"type":"question","settings":{"title":"Do you offer change-of-mind returns?","icon":"none","text":"<p>Due to the nature of customised uniforms and merchandise, we are unable to offer returns in this instance. Please choose your designs and sizes carefully, as we do not offer returns or exchanges for incorrect size selections or change-of-mind purchases. Our return policy only covers faulty or incorrect items.<\/p><p>For full details, visit our Returns & Refunds Policy<a href=\"https:\/\/corporate.yarn.com.au\/pages\/returns\"> <span style=\"text-decoration:underline\">here<\/span><\/a>.<\/p>","page":"","image_width":100}},"question_3XYHG7":{"type":"question","settings":{"title":"How can I return my online purchase?","icon":"none","text":"<p>If you believe your order is faulty or incorrect, please contact your sales representative and they will assist in a manual return, refund, or replacement of your order\/items. <\/p><p>For full details, visit our Returns & Refunds Policy<a href=\"https:\/\/corporate.yarn.com.au\/pages\/returns\"> <span style=\"text-decoration:underline\">here<\/span><\/a>.<\/p>","page":"","image_width":100}},"question_ykUAxP":{"type":"question","settings":{"title":"How are refunds processed?","icon":"none","text":"<p>Refunds are processed once a return is approved, with the amount issued back to your original payment method. Processing times may vary depending on your bank or provider.<\/p><p>For full details, visit our Returns & Refunds Policy<a href=\"https:\/\/corporate.yarn.com.au\/pages\/returns\"> <span style=\"text-decoration:underline\">here<\/span><\/a>.<\/p>","page":"","image_width":100}},"category_jUFkpV":{"type":"category","settings":{"title":"NAIDOC FAQ's","background_color":"#F5F5F5","icon":"none"}},"question_hpzhbP":{"type":"question","settings":{"title":"What is NAIDOC Week?","icon":"none","text":"<p>NAIDOC Week (6th–13th July 2025) is a national celebration that honours First Nations history, culture, and achievements. It’s an opportunity for businesses, schools, and organisations to show support and promote awareness.<\/p>","page":"","image_width":100}},"question_4iDctF":{"type":"question","settings":{"title":"What makes the NAIDOC 2025 collection special?","icon":"none","text":"<p>This year marks the 50th anniversary of NAIDOC Week, marking a milestone celebration.<br\/>Our NAIDOC collection features exclusive designs by First Nations artists, created specifically for this event.<\/p>","page":"","image_width":100}},"question_QQMG7X":{"type":"question","settings":{"title":"Why should my organisation celebrate NAIDOC?","icon":"none","text":"<p>NAIDOC Week is an opportunity to:<\/p><ul><li>Acknowledge and celebrate First Nations culture in your workplace<\/li><li>Strengthen diversity and inclusion efforts<\/li><li>Support Indigenous artists through meaningful uniforms & merchandis<\/li><li>Align with your Reconciliation Action Plan (RAP) initiatives<\/li><\/ul>","page":"","image_width":100}},"question_cwkbxz":{"type":"question","settings":{"title":"Why is it important to order early for NAIDOC Week?","icon":"none","text":"<p>NAIDOC is our biggest corporate event of the year, and demand is high.<br\/>To ensure your team is NAIDOC-ready, we recommend placing custom orders at least 6 weeks in advance.<\/p>","page":"","image_width":100}},"question_bjAzAX":{"type":"question","settings":{"title":"Can our organisation be featured in your NAIDOC showcase?","icon":"none","text":"<p>Yes! We’d love to showcase teams celebrating NAIDOC in our testimonial space. We also offer case studies featuring corporate clients who have integrated First Nations-inspired designs into their workplace. If you’d like to be featured or learn more, reach out to us at corporate@yarn.com.au.<\/p>","page":"","image_width":100}}},"block_order":["category1","question1","question2","question3","question_jmmP3g","question_YGtJXH","question_q6L94f","question_paLCbE","category2","question4","question5","question6","question7","question_UBnHmz","question_M8wTb3","question_eKrAfm","question_Xybg4n","question_AiXCmX","question_XYWmtF","category3","question8","question9","question_eBBcid","question_3XYHG7","question_ykUAxP","category_jUFkpV","question_hpzhbP","question_4iDctF","question_QQMG7X","question_cwkbxz","question_bjAzAX"],"custom_css":[".accordeon-plus__icon {margin: 0;}"],"settings":{"color_scheme":"default","container_size":"xsmall","section_spacing_top":40,"section_spacing_bottom":96,"section_layout":"bottom-tabs","title":"FAQ's","text":"<p>Got questions? We’ve got answers!<\/p><p>Welcome to our FAQs. Here, you’ll find answers to the most common questions about Yarn Corp – from our products and orders to shipping and returns. If you can’t find what you’re looking for, our team is always happy to help. Feel free to <a href=\"\/pages\/contact\" title=\"Contact\">contact us<\/a> at anytime! <\/p>","heading_size":"h1","body_size":"body3","btn_text":"","btn_url":"","btn_style":"solid"}},"1d503804-358e-4338-81be-509bc3267c77":{"type":"newsletter","blocks":{"template--16927600148694__1d503804-358e-4338-81be-509bc3267c77-title-1":{"type":"title","settings":{"title":"Want 10% Off your first order?","heading_size":"h1"}},"template--16927600148694__1d503804-358e-4338-81be-509bc3267c77-text-1":{"type":"text","settings":{"text":"Subscribe now and get <strong>10% OFF<\/strong> on your first order. Be the first to access pre-order & new product releases, get exclusive deals and receive our latest catalogues.","body_size":"body3"}},"template--16927600148694__1d503804-358e-4338-81be-509bc3267c77-subscribe-1":{"type":"subscribe","settings":{"input_style":"solid"}}},"block_order":["template--16927600148694__1d503804-358e-4338-81be-509bc3267c77-title-1","template--16927600148694__1d503804-358e-4338-81be-509bc3267c77-text-1","template--16927600148694__1d503804-358e-4338-81be-509bc3267c77-subscribe-1"],"settings":{"color_scheme":"custom-2","enable_background_around_container":false,"container_size":"full-screen","section_spacing_top":0,"section_spacing_bottom":0,"desktop_height":320,"mobile_height":420,"desktop_overlay_opacity":20,"mobile_overlay_opacity":20,"desktop_content_position":"align-items: center;justify-content:center;","desktop_content_align":"center","content_max_width":804,"content_spacing":16,"mobile_content_position":"align-items:center;justify-content:center;","mobile_content_align":"center","desktop_content_background":"none","mobile_content_background":"none"}}},"order":["page","questions","1d503804-358e-4338-81be-509bc3267c77"]}